# Pandas

In [66]:
import pandas as pd

In [67]:
numbers = [1, 2, 3, 4, 5]
series = pd.Series(numbers)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [68]:
dictionary = {'a':1, 'b': 2, 'c': 3, 'd': 4}
series1 = pd.Series(dictionary)
print(series1)

a    1
b    2
c    3
d    4
dtype: int64

In [69]:
gdp = [4.18, 4.9, 19, 30.1]
country = ['India', 'Germany', 'China', 'Ameria']
print(pd.Series(data = gdp, index = country))

India       4.18
Germany     4.90
China      19.00
Ameria     30.10
dtype: float64

In [70]:
# DataFrame from a dictionary of list

data = {'Name' :['dhana', 'azzizat', 'kennady', 'ana'],
        'Country' : ['India', 'Nigeria', 'Nigeria', 'Mexico'],
        'Occupation': ['Data Scientist', 'Police' ,'Helthcare', 'Lecturare']}

df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Country      Occupation
0    dhana    India  Data Scientist
1  azzizat  Nigeria          Police
2  kennady  Nigeria       Helthcare
3      ana   Mexico       Lecturare
<class 'pandas.core.frame.DataFrame'>

In [71]:
data = [{'Name': 'Dhana', 'Country': 'India', 'Occupation': 'Data Scientist'},
        {'Name': 'Azzizat', 'Country': 'Nigeria', 'Occupation': 'Police'},
        {'Name': 'Kennady', 'Country': 'Nigeria', 'Occupation': 'Helthcare Worker'},
        {'Name': 'Ana', 'Country': 'Mexico', 'Occupation':'Lecturare'}]
df = pd.DataFrame(data)
print(df)

      Name  Country        Occupation
0    Dhana    India    Data Scientist
1  Azzizat  Nigeria            Police
2  Kennady  Nigeria  Helthcare Worker
3      Ana   Mexico         Lecturare

In [72]:
df1 = pd.read_csv('data.csv')
print(df.head())
print(df.tail())

      Name  Country        Occupation
0    Dhana    India    Data Scientist
1  Azzizat  Nigeria            Police
2  Kennady  Nigeria  Helthcare Worker
3      Ana   Mexico         Lecturare
      Name  Country        Occupation
0    Dhana    India    Data Scientist
1  Azzizat  Nigeria            Police
2  Kennady  Nigeria  Helthcare Worker
3      Ana   Mexico         Lecturare

In [73]:
print(df['Name'])

0      Dhana
1    Azzizat
2    Kennady
3        Ana
Name: Name, dtype: object

In [74]:
# Accessing specified elements

print(df.at[1, 'Name'])

Azzizat

In [75]:
print(df.at[3, 'Country'])

Mexico

In [76]:
print(df.iat[1, 2])

Police

In [77]:
# Data Manipulation

df['Salary'] = [100000, 40000, 30000, 40000]
print(df)

      Name  Country        Occupation  Salary
0    Dhana    India    Data Scientist  100000
1  Azzizat  Nigeria            Police   40000
2  Kennady  Nigeria  Helthcare Worker   30000
3      Ana   Mexico         Lecturare   40000

In [78]:
df.drop('Salary', axis=1, inplace= True)
print(df)

      Name  Country        Occupation
0    Dhana    India    Data Scientist
1  Azzizat  Nigeria            Police
2  Kennady  Nigeria  Helthcare Worker
3      Ana   Mexico         Lecturare

In [79]:
df.drop(0, inplace=True)

In [80]:
print(df)

      Name  Country        Occupation
1  Azzizat  Nigeria            Police
2  Kennady  Nigeria  Helthcare Worker
3      Ana   Mexico         Lecturare

In [81]:
# Data Anlysis

print(df1.dtypes)

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [82]:
print(df1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      50 non-null     object
 1   Category  50 non-null     object
 2   Value     47 non-null     float64
 3   Product   50 non-null     object
 4   Sales     46 non-null     float64
 5   Region    50 non-null     object
dtypes: float64(2), object(4)
memory usage: 2.5+ KB
None

In [83]:
print(df1.head())

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [84]:
print(df1.describe())

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [85]:
print(df1.isnull().sum())

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [86]:
print(df1.isnull().any())

Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool

In [87]:
df1_filled = df1.fillna(0)

In [88]:
print(df1_filled.isnull().any())

Date        False
Category    False
Value       False
Product     False
Sales       False
Region      False
dtype: bool

In [89]:
df1['Sales_filled_Mean'] = df1['Sales'].fillna(df1['Sales'].mean())

In [90]:
print(df1)

          Date Category  Value   Product  Sales Region  Sales_filled_Mean
0   2023-01-01        A   28.0  Product1  754.0   East         754.000000
1   2023-01-02        B   39.0  Product3  110.0  North         110.000000
2   2023-01-03        C   32.0  Product2  398.0   East         398.000000
3   2023-01-04        B    8.0  Product1  522.0   East         522.000000
4   2023-01-05        B   26.0  Product3  869.0  North         869.000000
5   2023-01-06        B   54.0  Product3  192.0   West         192.000000
6   2023-01-07        A   16.0  Product1  936.0   East         936.000000
7   2023-01-08        C   89.0  Product1  488.0   West         488.000000
8   2023-01-09        C   37.0  Product3  772.0   West         772.000000
9   2023-01-10        A   22.0  Product2  834.0   West         834.000000
10  2023-01-11        B    7.0  Product1  842.0  North         842.000000
11  2023-01-12        B   60.0  Product2    NaN   West         557.130435
12  2023-01-13        A   70.0  Product3  628.0  South         628.000000
13  2023-01-14        A   69.0  Product1  423.0   East         423.000000
14  2023-01-15        A   47.0  Product2  893.0   West         893.000000
15  2023-01-16        C    NaN  Product1  895.0  North         895.000000
16  2023-01-17        C   93.0  Product2  511.0  South         511.000000
17  2023-01-18        C    NaN  Product1  108.0   West         108.000000
18  2023-01-19        A   31.0  Product2  578.0   West         578.000000
19  2023-01-20        A   59.0  Product1  736.0   East         736.000000
20  2023-01-21        C   82.0  Product3  606.0  South         606.000000
21  2023-01-22        C   37.0  Product2  992.0  South         992.000000
22  2023-01-23        B   62.0  Product3  942.0  North         942.000000
23  2023-01-24        C   92.0  Product2  342.0   West         342.000000
24  2023-01-25        A   24.0  Product2  458.0   East         458.000000
25  2023-01-26        C   95.0  Product1  584.0   West         584.000000
26  2023-01-27        C   71.0  Product2  619.0  North         619.000000
27  2023-01-28        C   56.0  Product2  224.0  North         224.000000
28  2023-01-29        B    NaN  Product3  617.0  North         617.000000
29  2023-01-30        C   51.0  Product2  737.0  South         737.000000
30  2023-01-31        B   50.0  Product3  735.0   West         735.000000
31  2023-02-01        A   17.0  Product2  189.0   West         189.000000
32  2023-02-02        B   63.0  Product3  338.0  South         338.000000
33  2023-02-03        C   27.0  Product3    NaN   East         557.130435
34  2023-02-04        C   70.0  Product3  669.0   West         669.000000
35  2023-02-05        B   60.0  Product2    NaN   West         557.130435
36  2023-02-06        C   36.0  Product3  177.0   East         177.000000
37  2023-02-07        C    2.0  Product1    NaN  North         557.130435
38  2023-02-08        C   94.0  Product1  408.0  South         408.000000
39  2023-02-09        A   62.0  Product1  155.0   West         155.000000
40  2023-02-10        B   15.0  Product1  578.0   East         578.000000
41  2023-02-11        C   97.0  Product1  256.0   East         256.000000
42  2023-02-12        A   93.0  Product3  164.0   West         164.000000
43  2023-02-13        A   43.0  Product3  949.0   East         949.000000
44  2023-02-14        A   96.0  Product3  830.0   East         830.000000
45  2023-02-15        B   99.0  Product2  599.0   West         599.000000
46  2023-02-16        B    6.0  Product1  938.0  South         938.000000
47  2023-02-17        B   69.0  Product3  143.0   West         143.000000
48  2023-02-18        C   65.0  Product3  182.0  North         182.000000
49  2023-02-19        C   11.0  Product3  708.0  North         708.000000

In [91]:
print(df1.columns)

Index(['Date', 'Category', 'Value', 'Product', 'Sales', 'Region',
       'Sales_filled_Mean'],
      dtype='object')

In [92]:
df1 = df1.rename(columns={'Sales_filled_Mean': 'Sales_filled'})
print(df1.head(1))

         Date Category  Value   Product  Sales Region  Sales_filled
0  2023-01-01        A   28.0  Product1  754.0   East         754.0

In [93]:
df1

          Date Category  Value   Product  Sales Region  Sales_filled
0   2023-01-01        A   28.0  Product1  754.0   East    754.000000
1   2023-01-02        B   39.0  Product3  110.0  North    110.000000
2   2023-01-03        C   32.0  Product2  398.0   East    398.000000
3   2023-01-04        B    8.0  Product1  522.0   East    522.000000
4   2023-01-05        B   26.0  Product3  869.0  North    869.000000
5   2023-01-06        B   54.0  Product3  192.0   West    192.000000
6   2023-01-07        A   16.0  Product1  936.0   East    936.000000
7   2023-01-08        C   89.0  Product1  488.0   West    488.000000
8   2023-01-09        C   37.0  Product3  772.0   West    772.000000
9   2023-01-10        A   22.0  Product2  834.0   West    834.000000
10  2023-01-11        B    7.0  Product1  842.0  North    842.000000
11  2023-01-12        B   60.0  Product2    NaN   West    557.130435
12  2023-01-13        A   70.0  Product3  628.0  South    628.000000
13  2023-01-14        A   69.0  Product1  423.0   East    423.000000
14  2023-01-15        A   47.0  Product2  893.0   West    893.000000
15  2023-01-16        C    NaN  Product1  895.0  North    895.000000
16  2023-01-17        C   93.0  Product2  511.0  South    511.000000
17  2023-01-18        C    NaN  Product1  108.0   West    108.000000
18  2023-01-19        A   31.0  Product2  578.0   West    578.000000
19  2023-01-20        A   59.0  Product1  736.0   East    736.000000
20  2023-01-21        C   82.0  Product3  606.0  South    606.000000
21  2023-01-22        C   37.0  Product2  992.0  South    992.000000
22  2023-01-23        B   62.0  Product3  942.0  North    942.000000
23  2023-01-24        C   92.0  Product2  342.0   West    342.000000
24  2023-01-25        A   24.0  Product2  458.0   East    458.000000
25  2023-01-26        C   95.0  Product1  584.0   West    584.000000
26  2023-01-27        C   71.0  Product2  619.0  North    619.000000
27  2023-01-28        C   56.0  Product2  224.0  North    224.000000
28  2023-01-29        B    NaN  Product3  617.0  North    617.000000
29  2023-01-30        C   51.0  Product2  737.0  South    737.000000
30  2023-01-31        B   50.0  Product3  735.0   West    735.000000
31  2023-02-01        A   17.0  Product2  189.0   West    189.000000
32  2023-02-02        B   63.0  Product3  338.0  South    338.000000
33  2023-02-03        C   27.0  Product3    NaN   East    557.130435
34  2023-02-04        C   70.0  Product3  669.0   West    669.000000
35  2023-02-05        B   60.0  Product2    NaN   West    557.130435
36  2023-02-06        C   36.0  Product3  177.0   East    177.000000
37  2023-02-07        C    2.0  Product1    NaN  North    557.130435
38  2023-02-08        C   94.0  Product1  408.0  South    408.000000
39  2023-02-09        A   62.0  Product1  155.0   West    155.000000
40  2023-02-10        B   15.0  Product1  578.0   East    578.000000
41  2023-02-11        C   97.0  Product1  256.0   East    256.000000
42  2023-02-12        A   93.0  Product3  164.0   West    164.000000
43  2023-02-13        A   43.0  Product3  949.0   East    949.000000
44  2023-02-14        A   96.0  Product3  830.0   East    830.000000
45  2023-02-15        B   99.0  Product2  599.0   West    599.000000
46  2023-02-16        B    6.0  Product1  938.0  South    938.000000
47  2023-02-17        B   69.0  Product3  143.0   West    143.000000
48  2023-02-18        C   65.0  Product3  182.0  North    182.000000
49  2023-02-19        C   11.0  Product3  708.0  North    708.000000

In [95]:
df1_filled['New_Sales'] = df1_filled['Sales'].astype(int)

In [96]:
print(df1_filled)

          Date Category  Value   Product  Sales Region  New_Sales
0   2023-01-01        A   28.0  Product1  754.0   East        754
1   2023-01-02        B   39.0  Product3  110.0  North        110
2   2023-01-03        C   32.0  Product2  398.0   East        398
3   2023-01-04        B    8.0  Product1  522.0   East        522
4   2023-01-05        B   26.0  Product3  869.0  North        869
5   2023-01-06        B   54.0  Product3  192.0   West        192
6   2023-01-07        A   16.0  Product1  936.0   East        936
7   2023-01-08        C   89.0  Product1  488.0   West        488
8   2023-01-09        C   37.0  Product3  772.0   West        772
9   2023-01-10        A   22.0  Product2  834.0   West        834
10  2023-01-11        B    7.0  Product1  842.0  North        842
11  2023-01-12        B   60.0  Product2    0.0   West          0
12  2023-01-13        A   70.0  Product3  628.0  South        628
13  2023-01-14        A   69.0  Product1  423.0   East        423
14  2023-01-15        A   47.0  Product2  893.0   West        893
15  2023-01-16        C    0.0  Product1  895.0  North        895
16  2023-01-17        C   93.0  Product2  511.0  South        511
17  2023-01-18        C    0.0  Product1  108.0   West        108
18  2023-01-19        A   31.0  Product2  578.0   West        578
19  2023-01-20        A   59.0  Product1  736.0   East        736
20  2023-01-21        C   82.0  Product3  606.0  South        606
21  2023-01-22        C   37.0  Product2  992.0  South        992
22  2023-01-23        B   62.0  Product3  942.0  North        942
23  2023-01-24        C   92.0  Product2  342.0   West        342
24  2023-01-25        A   24.0  Product2  458.0   East        458
25  2023-01-26        C   95.0  Product1  584.0   West        584
26  2023-01-27        C   71.0  Product2  619.0  North        619
27  2023-01-28        C   56.0  Product2  224.0  North        224
28  2023-01-29        B    0.0  Product3  617.0  North        617
29  2023-01-30        C   51.0  Product2  737.0  South        737
30  2023-01-31        B   50.0  Product3  735.0   West        735
31  2023-02-01        A   17.0  Product2  189.0   West        189
32  2023-02-02        B   63.0  Product3  338.0  South        338
33  2023-02-03        C   27.0  Product3    0.0   East          0
34  2023-02-04        C   70.0  Product3  669.0   West        669
35  2023-02-05        B   60.0  Product2    0.0   West          0
36  2023-02-06        C   36.0  Product3  177.0   East        177
37  2023-02-07        C    2.0  Product1    0.0  North          0
38  2023-02-08        C   94.0  Product1  408.0  South        408
39  2023-02-09        A   62.0  Product1  155.0   West        155
40  2023-02-10        B   15.0  Product1  578.0   East        578
41  2023-02-11        C   97.0  Product1  256.0   East        256
42  2023-02-12        A   93.0  Product3  164.0   West        164
43  2023-02-13        A   43.0  Product3  949.0   East        949
44  2023-02-14        A   96.0  Product3  830.0   East        830
45  2023-02-15        B   99.0  Product2  599.0   West        599
46  2023-02-16        B    6.0  Product1  938.0  South        938
47  2023-02-17        B   69.0  Product3  143.0   West        143
48  2023-02-18        C   65.0  Product3  182.0  North        182
49  2023-02-19        C   11.0  Product3  708.0  North        708

In [98]:
df1_filled['Sales_New'] = df1_filled['Sales'].apply(lambda x:x*1.5)
print(df1_filled)

          Date Category  Value   Product  Sales Region  New_Sales  Sales_New
0   2023-01-01        A   28.0  Product1  754.0   East        754     1131.0
1   2023-01-02        B   39.0  Product3  110.0  North        110      165.0
2   2023-01-03        C   32.0  Product2  398.0   East        398      597.0
3   2023-01-04        B    8.0  Product1  522.0   East        522      783.0
4   2023-01-05        B   26.0  Product3  869.0  North        869     1303.5
5   2023-01-06        B   54.0  Product3  192.0   West        192      288.0
6   2023-01-07        A   16.0  Product1  936.0   East        936     1404.0
7   2023-01-08        C   89.0  Product1  488.0   West        488      732.0
8   2023-01-09        C   37.0  Product3  772.0   West        772     1158.0
9   2023-01-10        A   22.0  Product2  834.0   West        834     1251.0
10  2023-01-11        B    7.0  Product1  842.0  North        842     1263.0
11  2023-01-12        B   60.0  Product2    0.0   West          0        0.0
12  2023-01-13        A   70.0  Product3  628.0  South        628      942.0
13  2023-01-14        A   69.0  Product1  423.0   East        423      634.5
14  2023-01-15        A   47.0  Product2  893.0   West        893     1339.5
15  2023-01-16        C    0.0  Product1  895.0  North        895     1342.5
16  2023-01-17        C   93.0  Product2  511.0  South        511      766.5
17  2023-01-18        C    0.0  Product1  108.0   West        108      162.0
18  2023-01-19        A   31.0  Product2  578.0   West        578      867.0
19  2023-01-20        A   59.0  Product1  736.0   East        736     1104.0
20  2023-01-21        C   82.0  Product3  606.0  South        606      909.0
21  2023-01-22        C   37.0  Product2  992.0  South        992     1488.0
22  2023-01-23        B   62.0  Product3  942.0  North        942     1413.0
23  2023-01-24        C   92.0  Product2  342.0   West        342      513.0
24  2023-01-25        A   24.0  Product2  458.0   East        458      687.0
25  2023-01-26        C   95.0  Product1  584.0   West        584      876.0
26  2023-01-27        C   71.0  Product2  619.0  North        619      928.5
27  2023-01-28        C   56.0  Product2  224.0  North        224      336.0
28  2023-01-29        B    0.0  Product3  617.0  North        617      925.5
29  2023-01-30        C   51.0  Product2  737.0  South        737     1105.5
30  2023-01-31        B   50.0  Product3  735.0   West        735     1102.5
31  2023-02-01        A   17.0  Product2  189.0   West        189      283.5
32  2023-02-02        B   63.0  Product3  338.0  South        338      507.0
33  2023-02-03        C   27.0  Product3    0.0   East          0        0.0
34  2023-02-04        C   70.0  Product3  669.0   West        669     1003.5
35  2023-02-05        B   60.0  Product2    0.0   West          0        0.0
36  2023-02-06        C   36.0  Product3  177.0   East        177      265.5
37  2023-02-07        C    2.0  Product1    0.0  North          0        0.0
38  2023-02-08        C   94.0  Product1  408.0  South        408      612.0
39  2023-02-09        A   62.0  Product1  155.0   West        155      232.5
40  2023-02-10        B   15.0  Product1  578.0   East        578      867.0
41  2023-02-11        C   97.0  Product1  256.0   East        256      384.0
42  2023-02-12        A   93.0  Product3  164.0   West        164      246.0
43  2023-02-13        A   43.0  Product3  949.0   East        949     1423.5
44  2023-02-14        A   96.0  Product3  830.0   East        830     1245.0
45  2023-02-15        B   99.0  Product2  599.0   West        599      898.5
46  2023-02-16        B    6.0  Product1  938.0  South        938     1407.0
47  2023-02-17        B   69.0  Product3  143.0   West        143      214.5
48  2023-02-18        C   65.0  Product3  182.0  North        182      273.0
49  2023-02-19        C   11.0  Product3  708.0  North        708     1062.0

In [99]:
# Data Aggregating and Grouping

df1_filled.groupby('Product')['Value'].mean()

Product
Product1    40.437500
Product2    52.800000
Product3    52.263158
Name: Value, dtype: float64

In [101]:
df1_filled.groupby(['Region', 'Product'])['Sales'].sum()

Region  Product
East    Product1    4205.0
        Product2     856.0
        Product3    1956.0
North   Product1    1737.0
        Product2     843.0
        Product3    3428.0
South   Product1    1346.0
        Product2    2240.0
        Product3    1572.0
West    Product1    1335.0
        Product2    3435.0
        Product3    2675.0
Name: Sales, dtype: float64

In [102]:
df1_filled.groupby('Region')['Value'].agg(['mean', 'sum', 'count'])

             mean     sum  count
Region
East    42.307692   550.0     13
North   30.818182   339.0     11
South   62.000000   496.0      8
West    58.166667  1047.0     18

In [104]:
# Merging DataFrames

dfA = pd.DataFrame({'key': ['a', 'b', 'c'], 'value': [1, 2, 3]})
dfB = pd.DataFrame({'key': ['a', 'b', 'c'], 'result': [4, 5, 6]})

print(dfA)
print(dfB)

  key  value
0   a      1
1   b      2
2   c      3
  key  result
0   a       4
1   b       5
2   c       6

In [106]:
pd.merge(dfA, dfB, on='key', how='inner')

  key  value  result
0   a      1       4
1   b      2       5
2   c      3       6

In [110]:
dfA = pd.DataFrame({'key': ['a', 'b', 'c'], 'value': [1, 2, 3]})
dfB = pd.DataFrame({'key': ['a', 'b', 'd'], 'result': [4, 5, 6]})

print(dfA)
print(dfB)

print(pd.merge(dfA, dfB, on='key', how = 'outer'))
print(pd.merge(dfA, dfB, on='key', how = 'left'))
print(pd.merge(dfA, dfB, on='key', how = 'right'))

  key  value
0   a      1
1   b      2
2   c      3
  key  result
0   a       4
1   b       5
2   d       6
  key  value  result
0   a    1.0     4.0
1   b    2.0     5.0
2   c    3.0     NaN
3   d    NaN     6.0
  key  value  result
0   a      1     4.0
1   b      2     5.0
2   c      3     NaN
  key  value  result
0   a    1.0       4
1   b    2.0       5
2   d    NaN       6

In [117]:
# Loading data sources

url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list"
failed_bank = pd.read_html(url)

In [120]:
print(failed_bank)

[                               Bank Name           City         State   Cert  \
0           The Santa Anna National Bank     Santa Anna         Texas   5520
1                   Pulaski Savings Bank        Chicago      Illinois  28611
2     The First National Bank of Lindsay        Lindsay      Oklahoma   4134
3  Republic First Bank dba Republic Bank   Philadelphia  Pennsylvania  27332
4                          Citizens Bank       Sac City          Iowa   8758
5               Heartland Tri-State Bank        Elkhart        Kansas  25851
6                    First Republic Bank  San Francisco    California  59017
7                         Signature Bank       New York      New York  57053
8                    Silicon Valley Bank    Santa Clara    California  24735
9                      Almena State Bank         Almena        Kansas  15426

                 Acquiring Institution      Closing Date  Fund  Sort ascending
0            Coleman County State Bank     June 27, 2025                 10549
1                      Millennium Bank  January 17, 2025                 10548
2   First Bank & Trust Co., Duncan, OK  October 18, 2024                 10547
3    Fulton Bank, National Association    April 26, 2024                 10546
4            Iowa Trust & Savings Bank  November 3, 2023                 10545
5               Dream First Bank, N.A.     July 28, 2023                 10544
6            JPMorgan Chase Bank, N.A.       May 1, 2023                 10543
7                  Flagstar Bank, N.A.    March 12, 2023                 10540
8  First Citizens Bank & Trust Company    March 10, 2023                 10539
9                          Equity Bank  October 23, 2020                 10538  ]

In [121]:
url = 'https://en.wikipedia.org/wiki/Mobile_country_code'
mobile_country_code = pd.read_html(url, match = 'Country', header = 0)

In [122]:
print(mobile_country_code)

[     Mobile country code                                    Country ISO 3166  \
0                    289                                 A Abkhazia    GE-AB
1                    412                                Afghanistan       AF
2                    276                                    Albania       AL
3                    603                                    Algeria       DZ
4                    544  American Samoa (United States of America)       AS
..                   ...                                        ...      ...
247                  452                                    Vietnam       VN
248                  543                        W Wallis and Futuna       WF
249                  421                                    Y Yemen       YE
250                  645                                   Z Zambia       ZM
251                  648                                   Zimbabwe       ZW

                                  Mobile network codes National MNC authority  \
0             List of mobile network codes in Abkhazia                    NaN
1          List of mobile network codes in Afghanistan                    NaN
2              List of mobile network codes in Albania                    NaN
3              List of mobile network codes in Algeria                    NaN
4       List of mobile network codes in American Samoa                    NaN
..                                                 ...                    ...
247        List of mobile network codes in the Vietnam                    NaN
248  List of mobile network codes in Wallis and Futuna                    NaN
249          List of mobile network codes in the Yemen                    NaN
250             List of mobile network codes in Zambia                    NaN
251           List of mobile network codes in Zimbabwe                    NaN

                      Remarks
0    MCC is not listed by ITU
1                         NaN
2                         NaN
3                         NaN
4                         NaN
..                        ...
247                       NaN
248                       NaN
249                       NaN
250                       NaN
251                       NaN

[252 rows x 6 columns]]